Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/money_and_tax/personal_finance/debt/glossary_of_debt_terms.html.txt.tmx
Source language: en
Languages: ga

source: Most people would regard the repayments on their home as taking priority over the repayment of other loans
ga: Ceapfadh formhór na ndaoine go nglacfadh aisíocaíochtaí ar a mbaile tosaíocht ar aisíocaíocht iasachtaí eile

source: The legal meaning of priority debt may be different
ga: Féadfaidh an bhrí dhlíthiúil 'fiacha tosaíochta' a bheith difriúil

source: For example, in receiverships, liquidations and bankruptcy, the law sets out the order in which the debts must be paid
ga: Mar shampla, i nglacadóireachtaí, i leachtuithe agus i bhféimheacht, leagann an dlí síos an t-ord a gcaitear na fiacha a íoc

source: This is a certificate issued by a court to protect the debtor against legal proceedings by a creditor in respect of debts while a Personal Insolvency Arrangement (PIA) or a Debt Settlement Arrangement (DSA) is being put in place
ga: Is éard is deimhniú cosanta ann ná deimhniú arna eisiúint ag cúirt chun an féichiúnaí a chosaint i gcoinne imeachtaí dlí ag creidiúnaí maidir le fiachais fad is atá Socrú um Dhócmhainneacht Phearsanta (PIA) nó Socrú Réitigh Fiachais (DSA) á gcur i bhfeidhm

source: The protective certificate gives you 70 days during which your creditors may not:
ga: Tabharfaidh an deimhniú cosanta 70 lá duit, tráth nach féidir le do chreidiúnaithe an méid a leanas a dhéanamh:

source: • Start or continue legal proceedings in respect of the debt
ga: • Tús a chur le himeachtaí dlí maidir leis an bhfiachas nó leanúint leis na himeachtaí siúd

source: • Take or continue any steps to enforce a judgment or contact you about the debt unless you agree to this
ga: • Dul i mbun aon bhirt chun breithiúnas a fhorfheidhmiú nó leanúint leis na bearta siúd nó teagmháil a dhéanamh leat faoin bhfiachas mura gcomhaontaíonn tú leis seo

source: • Start or continue bankruptcy proceedings against you
ga: • Tús a chur le himeachtaí féimheachta i do leith nó leanúint leis na himeachtaí siúd

source: Reasonable living expenses are the expenses that an insolvent debtor will necessarily incur in achieving a ‘reasonable standard of living’ while engaging in one of the arrangements introduced by the Personal Insolvency Act 2012
ga: Is éard is costais réasúnta mhaireachtála ná costais riachtanacha a thabhóidh féichiúnaí d’fhonn ‘caighdeán réasúnta maireachtála’ a bhaint amach agus é nó í i mbun ceann de na socruithe a tugadh isteach leis an Acht um Dhócmhainneacht Phearsanta 2012

source: This minimum standard of living allows for expenses such as food, clothing, health, education, transport, childcare and insurance
ga: Ceadaíonn an meánchaighdeán maireachtála sin costais cosúil le bia, éadaí sláinte, oideachas, iompar, cúram leanaí agus árachas

source: The ISI has prepared detailed guidelines on what constitutes reasonable living expenses
ga: Tá treoirlínte sonraithe ullmhaithe ag an ISI ar cad is costais réasúnta mhaireachtála ann

source: These guidelines are regularly updated, as required under the Act
ga: Déantar na treoirlínte sin a nuashonrú go rialta, mar a éilítear faoin Acht

source: There is also an online calculator
ga: Tá áireamhán ar líne ar fáil chomh maith

source: This is a loan on which property or goods are available as security against non-payment
ga: Is iasacht í ar a bhfuil maoin nó earraí ar fáil mar urrús in aghaidh neamhíoca

source: Mortgages are the most common secured loans
ga: Is iad morgáistí na hiasachtaí urraithe is coitianta

source: Sometimes, business loans and other loans are also secured against property
ga: Uaireanta, tá iasachtaí gnó agus iasachtaí eile daingnithe in aghaidh maoine freisin

source: In general, debts such as bank loans and credit card debt are unsecured
ga: Go ginearálta, níl fiacha cosúil le hiasachtaí bainc agus fiach cárta creidmheasa daingnithe

source: However, if you decide to roll up such loans into your mortgage, they now become secured loans
ga: Mar sin féin, má shocraíonn tú iasachtaí mar sin a rolladh suas i do mhorgáiste, bíonn siad mar iasachtaí urraithe anois

source: If the property or goods on which the security is based are subsequently sold, the secured loan must be paid off before the proceeds can be used for any other purposes
ga: Má dhíoltar an mhaoin nó na hearraí ar a bhfuil an slándáil bunaithe ina dhiaidh sin, ní mór an iasacht a íoc sular féidir na fáltais a úsáid le haghaidh aon chríocha eile

source: This is a debt which arises because you have not paid for goods or services which are not covered by any special rules
ga: Is fiach é seo a thagann chun solais de bharr nach bhfuil tú tar éis íoc as earraí nó seirbhísí nach bhfuil clúdaithe ag rialacha speisialta ar bith

source: For example, if you buy goods using a cheque and the cheque is not honoured, there is a simple contract debt to the seller
ga: Mar shampla, má cheannaíonn tú earraí ag baint úsáide as seic agus ní onóraítear an seic, tá fiach conartha simplí dlite don díoltóir

source: If you use the services of a plumber and do not pay him, there is a simple contract debt to the plumber
ga: Má bhaineann tú leas as na seirbhísí as pluiméir agus íocann tú é, tá fiach conartha simplí don phluiméir

source: The seller or the plumber can go to court to get judgment against you and then enforce that judgment
ga: Is féidir leis an díoltóir nó an pluiméir dul chun na cúirte chun breithiúnas a fháil i do choinne agus an breithiúnas a chur i bhfeidhm ansin

source: A range of legislation provides that various fees and levies which have not been paid may be dealt with in court in the same way as simple contract debts
ga: Soláthraíonn raon reachtaíochta gur féidir deileáil le táillí éagsúla agus tobhaigh nach bhfuil íoctha sa chúirt ar an mbealach céanna le fiacha conartha simplí

source: Sheriffs are self-employed people who enforce debt judgments in counties Cork and Dublin
ga: Is daoine féinfhostaithe iad Sirriamaí a fhorfheidhmíonn breithiúnais fiachais i gcontae Chorcaí agus i gcontae Bhaile Átha Cliath

source: County Registrars enforce debt judgments in all other places
ga: Forfheidhmíonn Cláraitheoirí Contae breithiúnais fiachais i ngach áit eile

source: Sheriffs are paid for their enforcement work on a commission basis
ga: Íoctar sirriamaí as a gcuid obair fhorfheidhmithe ar bhonn coimisiúin

source: As well as County Sheriffs in Cork and Dublin, Revenue Sheriffs enforce debts owed to the Revenue Commissioners
ga: Chomh maith le Sirriamaí Contae i gCorcaigh agus i mBaile Átha Cliath tá Sirriamí Ioncaim a chuireann fiacha atá dlite do na Coimisinéirí Ioncaim i bhfeidhm

source: They have the power to collect tax debts
ga: Tá an chumhacht acu fiacha cánach a bhailiú

source: They can do this on the basis of a certificate of liability issued by the Collector General and do not need a court order
ga: Is féidir leo é seo a dhéanamh trí theastas fiachais eisithe ag an Ard-Bhailitheoir agus ní gá ordú cúirte a bheith acu

source: Revenue debts can also be collected in the normal way if there is a court order
ga: Is féidir fiacha ioncaim a bhailiú freisin ar an ngnáthbhealach má tá ordú cúirte ann

source: A Standard Financial Statement (SFS) is a written statement of financial affairs on an industry standard format (pdf), which a borrower in mortgage difficulty must complete as part of the Mortgage Arrears Resolution Process (MARP)
ga: Is éard is Ráiteas Airgeadais Caighdeánach (SFS) ná ráiteas scríofa maidir le cúrsaí airgeadais ar fhormáid tionscalchaighdeánach, nach mór d’iasachtaí le deacrachtaí morgáiste a chomhlánú mar chuid de Phróiseas Réitigh do Riaráistí Morgáiste (MARP)

source: The lender must give the borrower an SFS form and must ensure that the borrower understands the MARP process
ga: Ní mór don iasachtóir foirm SFS a thabhairt don iasachtaí agus a chinntiú go dtuigeann an t-iasachtaí an próiseas MARP

source: It must offer help with completing the SFS and mention sources of independent advice, such as MABS
ga: Ní mór dó cabhair a thairiscint chun an SFS a chomhlánú agus foinsí comhairle neamhspleácha, cosúil le MABS a lua

source: It then uses the financial information on the form to assess the borrower’s financial position and identify the best course of action
ga: Baineann sé úsáid ansin as an t-eolas airgeadais ar an bhfoirm chun seasamh airgeadais an iasachtaí a mheas agus an cúrsa is fearr gníomhaíochta a aithint

source: The Central Bank has a consumer guide (pdf) to completing an SFS
ga: Tá treoir do thomhaltóirí ag an mBanc Ceannais faoi conas SFS a chomhlánú

source: MABS has also published a detailed guide to the SFS (pdf)
ga: Tá treoir mhionsonraithe maidir le SFS foilsithe ag MABS chomh maith

source: Time limits/Statute of Limitations
ga: Teorainneacha ama/Reacht na dTréimhsí

source: There are time limits (limitation periods) for taking most types of court action
ga: Tá teorainneacha ama (tréimhsí teorannaithe) chun tabhairt faoi bheagnach gach cineál gníomh cúirte

source: These time limits are set either in the Statute of Limitations 1957, as amended, or in specific legislation dealing with the court issue involved
ga: Tá na teorainneacha ama seo leagtha amach i Reacht na dTréimhsí 1957, arna leasú, nó i reachtaíocht shonrach ag déileáil leis an gceist cúirte i gceist

source: The law in relation to time limits is complex but, in general, the time limit for taking actions for breach of contract (for example, failure to pay for goods or services provided), for debt judgments and for non-payment of charges such as rent is 6 years
ga: Tá an dlí maidir le teorainneacha ama casta ach, go ginearálta, is í sé bliana an teorainn ama chun gníomhartha a ghlacadh maidir le sárú conartha (mar shampla, loiceadh íoc as earraí nó seirbhísí a sholáthar), le haghaidh breithiúnas fiacha agus muirir i leith neamhíoc ar nós cíosa

source: This means that if your creditor does not start the court action within 6 years of the debt being due, the action is statute-barred
ga: Ciallaíonn sé seo mura gcuireann do chreidiúnaí tús le caingne dlí laistigh de 6 bliana maidir leis an bhfiach atá dlite, tá an gníomh faoi urchosc reachta

source: Effectively, that means that you cannot be forced to pay the debt
ga: Go héifeachtach, ciallaíonn sé sin nach féidir iallach a chur ort an fiach a íoc

source: If your creditor gets a judgment, then, in general, they have 12 years in which to enforce that judgment
ga: Sa chás go bhfaigheann do chreidiúnaí breithiúnas, go ginearálta, tá 12 bliain acu an breithiúnas sin a fhorfheidhmiú

source: The general rules do not apply to taxes
ga: Ní bhaineann na rialacha ginearálta le cánacha

source: There is a 4-year time limit on the Revenue Commissioners seeking tax from you and there is a 4-year time limit on you seeking repayment of taxes that you were not due to pay
ga: Tá teorainn ama 4 bliana ar na Coimisinéirí Ioncaim ag lorg cána uait agus tá teorainn 4 bliana ort aisíoc cánacha a lorg nach raibh tú dlite a íoc

source: However, if there is any fraud or neglect, there is no time limit
ga: Mar sin féin, má tá calaois nó faillí ar bith ann, níl teorainn ama ar bith ann
